# 1、数字类型
# 1.1 整型int
# 作用：记录年龄、身份证号、个数等等
# 定义：
age = 18
# print(type(age))


# 浮点型float
# 作用：记录薪资、身高、体重
# 定义
salary = 3.3
height = 1.87
weight = 70.3
# print(type(height))

# 数字类型的其他使用
# level = 1
# level=level + 1
# print(level)
# print(10 *3)

# print(10 + 3.3) # int与float之间可以相加
# age = 19
# print(age > 18)


# 2、字符串类型str
# 作用：记录描述性质的状态，名字、一段话
# 定义：用引号（''，""，''' '''，""" """，）包含的一串字符

info = '''
天下只有两种人。比如一串葡萄到手，一种人挑最好的先吃，
另一种人把最好的留到最后吃。
照例第一种人应该乐观，因为他每吃一颗都是吃剩的葡萄里最好的；
第二种人应该悲观，因为他每吃一颗都是吃剩的葡萄里最坏的。
不过事实却适得其反，缘故是第二种人还有希望，第一种人只有回忆。
'''
# print(type(info))
# name="egon"
# print(name)

# x=18
# print(type(x))
# x='18' # 由数字组成的字符串，是字符串类型，不是int类型
# print(type(x))


# 'name'='egon' # 语法错误，等号左边是变量名，变量名的命名不能有引号

# xxx # 代表访问变量名字
'xxx'  # 代表的是值












































